# 字映射表

column_mapping = {
    # 报告头
    "EA01AI01": "report_no",  # 报告编号
    "EA01AR01": "report_time",  # 报告生成时间
    "EA01BI01": "query_org",  # 查询机构代码
    "EA01BD02": "query_reason",  # 查询原因
    "EA01CQ01": "ent_name",  # 企业名称
    "中征码": "credit_code",  # 中征码
    "统一社会信用代码": "unify_credit_code",  # 统一社会信用代码
    "组织机构代码": "org_code",  # 组织机构代码
    "纳税人识别号(国税)": "tax_payer_id_c",  # 纳税人识别号（国税）
    "纳税人识别号(地税)": "tax_payer_id_l",  # 纳税人识别号（地税）
    "工商注册号": "org_credit_code",  # 机构信用代码
    # 信贷交易提示信息
    "EB01AR01": "first_loan_year",  # 首次有信贷交易的年份
    "EB01AR02": "first_repay_duty_year",  # 首次有相关还款责任的年份
    "EB01AS01": "loan_org_num",  # 发生信贷交易的机构数
    "EB01AS02": "remain_loan_org_num",  # 当前有未结清信贷交易的机构数
    "EB01AJ01": "loan_bal",  # 借贷交易余额
    "EB01AJ02": "loan_recover_bal",  # 被追偿的借贷交易余额
    "EB01AJ03": "loan_special_mentioned_bal",  # 关注类借贷交易余额
    "EB01AJ04": "loan_non_performing_bal",  # 不良类借贷交易余额
    "EB01AJ05": "secured_bal",  # 担保交易余额
    "EB01AJ06": "secured_special_mentioned_bal",  # 关注类担保交易余额
    "EB01AJ07": "secured_non_performing_bal",  # 不良类担保交易余额
    "EB01BS01": "not_loan_account_num",  # 非信贷交易账户数
    "EB01BS02": "owing_taxes_num",  # 欠税记录条数
    "EB01BS03": "judge_num",  # 民事判决记录条数
    "EB01BS04": "enforce_num",  # 强制执行记录条数
    "EB01BS05": "admin_penalty_num",  # 行政处罚记录条数
    # 未结清借贷交易汇总-资产处置
    "EB02AS01": "dispose_account_num",  # 资产处置业务账户数
    "EB02AJ01": "dispose_balance",  # 资产处置业务余额
    "EB02AR01": "last_dispose_date",  # 最近一次处置日期
    "EB02AS02": "advance_account_num",  # 垫款业务账户数
    "EB02AJ02": "advance_balance",  # 垫款业务余额
    "EB02AR02": "last_repay_date",  # 垫款最近一次还款日期
    "EB02AJ03": "overdue_amt",  # 逾期总额
    "EB02AJ04": "overdue_principal",  # 逾期本金
    "EB02AJ05": "overdue_interest",  # 逾期利息及其他
    # 未结清借贷交易汇总-历史信息
    "EB02AD01": "loan_type",  # 业务类型
    "EB02AD02": "status_type",  # 资产质量分类
    "EB02AS04": "account_num",  # 账户数
    "EB02AJ06": "balance",  # 余额
    # 已结清借贷交易汇总-资产处置
    "EB02BS01": "dispose_account_num",  # 资产处置业务账户数
    "EB02BJ01": "dispose_balance",  # 资产处置业务金额
    "EB02BR01": "dispose_end_date",  # 处置完成日期
    "EB02BR02": "loan_end_date",  # 结清日期
    "EB02BS02": "advance_account_num",  # 垫款业务账户数
    "EB02BJ02": "advance_balance",  # 垫款业务金额
    # 已结清借贷交易汇总-历史信息
    "EB02BD01": "loan_type",  # 业务类型
    "EB02BD02": "status_type",  # 资产质量分类
    "正常类账户数": "normal_num",
    "不良类账户数": "non_performing_num",
    "关注类账户数": "special_mentioned_num",
    "合计": "total",
    "EB02BS04": "account_num",  # 账户数
    # 负债历史汇总-历史信息
    "EB02CR01": "stats_date",  # 月份
    "EB02CS02": "account_num1",  # 全部负债账户数
    "EB02CJ01": "balance1",  # 全部负债余额
    "EB02CS03": "account_num2",  # 关注类负债账户数
    "EB02CJ02": "balance2",  # 关注类负债余额
    "EB02CS04": "account_num3",  # 不良类负债账户数
    "EB02CJ03": "balance3",  # 不良类负债余额
    "EB02CS05": "overdue_account_num",  # 逾期账户数
    "EB02CJ04": "overdue_amt",  # 逾期总额
    "EB02CS06": "p_overdue_account_num",  # 逾期本金账户数
    "EB02CJ05": "overdue_principal",  # 逾期本金
    # 未结清担保历史信息
    "EB03AD01": "loan_type",  # 业务类型
    "EB03AD02": "status_type",  # 资产质量分类
    "EB03AS02": "account_num",  # 账户数
    "EB03AJ01": "balance",  # 余额
    # 已结清担保历史信息
    "EB03BD01": "loan_type",  # 业务类型
    "EB03BD02": "status_type",  # 资产质量分类
    "EB03BS02": "account_num",  # 账户数
    # 授信协议汇总信息
    "EB040J01": "acyclic_total_amt",  # 非循环信用额度合计
    "EB040J02": "acyclic_used_amt",  # 已使用的非循环信用额度合计
    "EB040J03": "acyclic_surplus_amt",  # 剩余可用的非循环额度合计
    "EB040J04": "cycle_total_amt",  # 循环信用额度合计
    "EB040J05": "cycle_used_amt",  # 已使用的循环信用额度合计
    "EB040J06": "cycle_surplus_amt",  # 剩余可用的循环额度合计
    # 借贷交易相关还款责任汇总信息
    "EB05AD01": "duty_type",  # 责任类型
    "EB05AJ01": "duty_amt1",  # 被追偿账户的还款责任金额
    "EB05AS02": "account_num1",  # 被追偿账户数
    "EB05AJ02": "balance1",  # 被追偿账户余额
    "EB05AJ03": "duty_amt2",  # 其他借贷交易的还款责任金额
    "EB05AS03": "account_num2",  # 其他借贷交易账户数
    "EB05AJ04": "balance2",  # 其他借贷交易账户余额
    "EB05AJ05": "non_performing_bal",  # 其他借贷交易账户关注类余额
    "EB05AJ06": "special_mentioned_bal",  # 其他借贷交易账户不良类余额
    # 担保交易相关还款责任汇总信息
    "EB05BD01": "duty_type",  # 责任类型
    "EB05BJ01": "duty_amt",  # 还款责任金额
    "EB05BS02": "account_num",  # 账户数
    "EB05BJ02": "balance",  # 余额
    "EB05BJ03": "non_performing_bal",  # 关注类余额
    "EB05BJ04": "special_mentioned_bal",  # 不良类余额
    # 企业基本信息
    "EC010D01": "economy_type",  # 经济类型
    "EC010D02": "org_type",  # 组织机构类型
    "EC010D03": "ent_scale",  # 企业规模
    "EC010D04": "industry",  # 所属行业
    "EC010Q01": "reg_site",  # 登记地址
    "EC010R01": "launch_year",  # 成立年份
    "EC010R02": "reg_cert_duedate",  # 登记证书有效截止日期
    "EC010Q02": "office_site",  # 办公/经营地址
    "EC010D05": "life_status",  # 存续状态
    # 出资人信息
    "EC020J01": "registered_capital",  # 注册资本（折人民币合计）
    "EC020R01": "update_date",  # 更新日期
    "EC020D01": "investor_type",  # 出资人类型
    "EC020Q01": "investor",  # 出资人名称
    "EC020D03": "cert_type",  # 出资人身份标识类型
    "EC020I01": "cert_no",  # 出资人身份标识号码
    "EC020Q02": "investor_rate",  # 出资比例
    # 股东信息
    "EC030R01": "update_date",  # 更新日期
    "EC030Q01": "cust_name",  # 姓名
    "EC030D01": "cert_type",  # 证件类型
    "EC030I01": "cert_no",  # 证件号码
    "EC030D02": "cust_position",  # 职位
    # 上级机构信息
    "EC040D01": "org_type",  # 上级机构类型
    "EC040Q01": "org_name",  # 上级机构名称
    "EC040D02": "cert_type",  # 上级机构身份标识类型
    "EC040I01": "cert_no",  # 上级机构身份标识号码
    "EC040R01": "update_date",  # 更新日期
    # 实控人信息
    "EC050R01": "update_date",  # 更新日期
    "EC050Q01": "cust_name",  # 实际控制人名称
    "EC050D02": "cert_type",  # 实际控制人身份标识类型
    "EC050I01": "cert_no",  # 实际控制人身份标识号码
    # 借贷账户信息
    "ED01AI01": "account_no",  # 借贷账户编号
    "ED01AD01": "settle_status",  # 账户活动状态
    "ED01AD02": "account_type",  # 借贷账户类型
    # "ED01AD04": "account_org1",  # 业务管理机构类型
    "ED01AI02": "account_org",  # 业务管理机构代码
    "ED01AI03": "credit_no",  # 授信协议编号
    # "ED01AD05": "biz_type1",  # 借贷业务种类大类
    "ED01AD06": "biz_type",  # 借贷业务种类细分
    "ED01AR01": "loan_date",  # 开立日期
    "ED01AD07": "currency",  # 币种
    "ED01AJ01": "amount",  # 借款金额
    "ED01AR02": "end_date",  # 到期日期
    "ED01AD08": "loan_guarantee_type",  # 担保方式
    "ED01AD10": "occur_type",  # 发放形式
    "ED01AR04": "stats_date",  # 信息报告日期
    "ED01BR01": "stats_date",  # 信息报告日期
    "ED01BJ01": "balance",  # 余额
    "ED01BR02": "bal_update_date",  # 余额变化日期
    "ED01BD01": "category",  # 五级分类
    "ED01BR03": "category_date",  # 五级分类认定日期
    "ED01BR04": "last_actual_paydate",  # 最近一次实际还款日期
    "ED01BJ02": "last_actual_payamount",  # 最近一次实际还款总额
    "ED01BD02": "last_payment_type",  # 最近一次还款形式
    "ED01BR05": "last_agreed_paydate",  # 最近一次约定还款日期
    "ED01BJ03": "last_agreed_amt",  # 最近一次应还总额
    "ED01BJ04": "overdue_amt",  # 逾期总额
    "ED01BJ05": "overdue_principal",  # 逾期本金
    "ED01BS02": "overdue_period",  # 逾期月数
    "ED01BS03": "surplus_repay_period",  # 剩余还款月数
    # 贴现账户分机构汇总信息
    "ED020I02": "account_org",  # 业务管理机构代码
    "ED020D02": "biz_type",  # 业务种类
    "ED020D03": "category",  # 五级分类
    "ED020S01": "account_num1",  # 未结清账户数
    "ED020J01": "balance",  # 余额合计
    "ED020J02": "overdue_amt",  # 逾期总额合计
    "ED020J03": "overdue_principal",  # 逾期本金合计
    "ED020S02": "account_num2",  # 已结清账户数
    "ED020J04": "discount_amt",  # 已结清账户贴现金额合计
    # 担保账户信息
    "ED04AI01": "account_no",  # 担保账户编号
    "ED04AD01": "loan_guarantee_type",  # 担保账户类型
    "ED04AI02": "account_org",  # 业务管理机构代码
    "ED04AI03": "credit_no",  # 授信协议编号
    "ED04AD03": "biz_type",  # 担保交易业务种类细分
    "ED04AR01": "loan_date",  # 开立日期
    "ED04AD04": "currency",  # 币种
    "ED04AJ01": "amount",  # 金额
    "ED04AR02": "end_date",  # 到期日期
    "ED04AD05": "counter_guarantee_type",  # 反担保方式
    "ED04AQ01": "deposit_rate",  # 保证金比例
    "ED04BR01": "stats_date",  # 信息报告日期
    "ED04BD01": "settle_status",  # 账户活动状态
    "ED04BJ01": "balance",  # 余额
    "ED04BD02": "category",  # 五级分类
    "ED04BJ02": "exposure_bal",  # 风险敞口
    "ED04BD03": "advanced_status",  # 代偿（垫款）标志
    "ED04BR02": "finish_date",  # 关闭日期
    # 在保责任信息
    "ED050I02": "account_org",  # 业务管理机构代码
    "ED050D02": "biz_type",  # 担保交易业务种类细分
    "ED050D03": "category",  # 五级分类
    "ED050S01": "account_num1",  # 未结清账户数
    "ED050J01": "balance",  # 余额
    "ED050J02": "end_30_bal",  # 30天内到期的余额
    "ED050J03": "end_60_bal",  # 60天内到期的余额
    "ED050J04": "end_90_bal",  # 90天内到期的余额
    "ED050J05": "end_more_90_bal",  # 90天后到期的余额
    "ED050S02": "account_num2",  # 已结清账户数
    # 授信协议信息
    "ED060I01": "credit_no",  # 授信协议编号
    "ED060I02": "account_org",  # 业务管理机构代码
    "ED060D02": "amt_type",  # 授信额度类型
    "ED060D03": "circle_status",  # 额度循环标志
    "ED060D04": "currency",  # 币种
    "ED060J01": "amount",  # 授信额度
    "ED060J04": "used_amt",  # 已用额度
    "ED060J03": "jhi_quota",  # 授信限额
    "ED060I03": "quota_no",  # 授信限额编号
    "ED060R01": "loan_date",  # 生效日期
    "ED060R02": "end_date",  # 终止日期
    "ED060R03": "stats_date",  # 信息报告日期
    # 相关还款责任信息
    "ED070I01": "account_no",  # 账户编号
    "ED070D03": "duty_type",  # 相关还款责任人类型
    "ED070J01": "duty_amt",  # 相关还款责任金额
    "ED070D04": "account_org",  # 业务管理机构类型
    "ED070I02": "org_no",  # 业务管理机构代码
    "ED070D05": "biz_type",  # 业务种类
    "ED070R01": "biz_date",  # 开立日期
    "ED070R02": "end_date",  # 到期日期
    "ED070D07": "currency",  # 币种
    "ED070J02": "balance",  # 余额
    "ED070D08": "category",  # 五级分类
    "ED070J03": "overdue_amt",  # 逾期总额
    "ED070J04": "overdue_principal",  # 逾期本金
    "ED070S01": "debt_status",  # 逾期月数
    "ED070S02": "surplus_repay_period",  # 剩余还款月数
    "ED070R03": "stats_date",  # 信息报告日期
    "ED070J05": "amount",  # 借款金额
    "ED070I03": "contract_no",  # 保证合同编号
    # 相关还款责任——贴现
    "ED080I01": "account_no",  # 贴现账户分机构汇总信息编号
    "ED080D01": "duty_type",  # 相关还款责任类型
    "ED080D02": "account_org",  # 业务管理机构类型
    "ED080I02": "org_no",  # 业务管理机构代码
    "ED080D03": "biz_type",  # 业务种类细分
    "ED080D04": "category",  # 五级分类
    "ED080J01": "duty_amt",  # 相关还款责任金额
    "ED080S01": "account_num",  # 账户数
    "ED080J02": "balance",  # 余额
    "ED080J03": "overdue_amt",  # 逾期总额
    "ED080J04": "overdue_principal",  # 逾期本金
    "ED080J05": "amount",  # 借款金额
    "ED080I03": "contract_no",  # 保证合同编号
    # 相关还款责任——担保
    "ED090I01": "account_no",  # 担保账户分机构汇总信息编号
    "ED090D01": "duty_type",  # 相关还款责任类型
    "ED090D02": "account_org",  # 业务管理机构类型
    "ED090I02": "org_no",  # 业务管理机构代码
    "ED090D03": "biz_type",  # 业务种类细分
    "ED090D04": "category",  # 五级分类
    "ED090J01": "duty_amt",  # 相关还款责任金额
    "ED090S01": "account_num",  # 账户数
    "ED090J02": "balance",  # 余额
    "ED100J03": "amount",  # 担保金额
    "ED090I03": "contract_no",  # 保证合同编号
    # 民事判决信息
    "EF020Q01": "court",  # 立案法院名称
    "EF020I02": "case_no",  # 案号
    "EF020R01": "filing_date",  # 立案日期
    "EF020Q02": "case_subject",  # 案由
    "EF020D01": "lawsuit_standi",  # 诉讼地位
    "EF020D02": "judge_procedure",  # 审判程序
    "EF020Q03": "target",  # 诉讼标的
    "EF020J01": "target_amt",  # 诉讼标的金额
    "EF020D03": "settle_type",  # 结案方式
    "EF020R02": "effective_date",  # 判决/调解生效日期
    "EF020Q04": "settle_result",  # 判决/调解结果
    # 强制执行信息
    "EF030Q01": "court",  # 执行法院名称
    "EF030I02": "case_no",  # 案号
    "EF030R01": "filing_date",  # 立案日期
    "EF030Q02": "case_subject",  # 执行案由
    "EF030Q03": "target",  # 申请执行标的
    "EF030J01": "target_amt",  # 申请执行标的金额
    "EF030Q04": "case_status",  # 案件状态
    "EF030D01": "settle_type",  # 结案方式
    "EF030Q05": "execution_target",  # 已执行标的
    "EF030J02": "execution_target_amt",  # 已执行标的金额
    # 行政处罚信息
    "EF040Q01": "org_name",  # 处罚机构名称
    "EF040I02": "wird_no",  # 处罚决定书文号
    "EF040Q02": "illegal_act",  # 违法行为
    "EF040Q03": "penalty_decision",  # 处罚决定
    "EF040R01": "penalty_date",  # 处罚日期
    "EF040J01": "penalty_amt",  # 处罚金额
    "EF040Q04": "execute_status",  # 处罚执行情况
    "EF040Q05": "review_result",  # 行政复议结果
    # 住房公积金参缴信息
    "EF05AR01": "first_date",  # 初缴年月
    "EF05AS01": "staff_num",  # 职工人数
    "EF05AJ01": "base_amt",  # 缴费基数
    "EF05AR02": "last_date",  # 最近一次缴费日期
    "EF05AR03": "end_date",  # 缴至年月
    "EF05AD01": "pay_status",  # 缴费状态
    "EF05AJ02": "arrearage_amt",  # 累计欠费金额
    "EF05AR04": "stats_date",  # 统计年月

    "EG01AI02": "org_code",  # 业务管理机构代码
    "EG01AR01": "report_year",  # 报表年份
    "EG01AD02": "report_type",  # 报表类型
    "EG01AD03": "report_nature",  # 报表类型细分

    "EG01BJ01": "货币资金",
    "EG01BJ02": "短期投资",
    "EG01BJ03": "应收票据",
    "EG01BJ04": "应收股利",
    "EG01BJ05": "应收利息",
    "EG01BJ06": "应收账款",
    "EG01BJ07": "其他应收款",
    "EG01BJ08": "预付账款",
    "EG01BJ09": "期货保证金",
    "EG01BJ10": "应收补贴款",
    "EG01BJ11": "应收出口退税",
    "EG01BJ12": "存货",
    "EG01BJ13": "存货原材料",
    "EG01BJ14": "存货产成品",
    "EG01BJ15": "待摊费用",
    "EG01BJ16": "待处理流动资产净损失",
    "EG01BJ17": "一年内到期的长期债权投资",
    "EG01BJ18": "其他流动资产",
    "EG01BJ19": "流动资产合计",
    "EG01BJ20": "长期投资",
    "EG01BJ21": "长期股权投资",
    "EG01BJ22": "长期债权投资",
    "EG01BJ23": "合并价差",
    "EG01BJ24": "长期投资合计",
    "EG01BJ25": "固定资产原价",
    "EG01BJ26": "累计折旧",
    "EG01BJ27": "固定资产净值",
    "EG01BJ28": "固定资产值减值准备",
    "EG01BJ29": "固定资产净额",
    "EG01BJ30": "固定资产清理",
    "EG01BJ31": "工程物资",
    "EG01BJ32": "在建工程",
    "EG01BJ33": "待处理固定资产净损失",
    "EG01BJ34": "固定资产合计",
    "EG01BJ35": "无形资产",
    "EG01BJ36": "（无形资产科目下）土地使用权",
    "EG01BJ37": "递延资产",
    "EG01BJ38": "（递延资产科目下）固定资产修理",
    "EG01BJ39": "（递延资产科目下）固定资产改良支出",
    "EG01BJ40": "其他长期资产",
    "EG01BJ41": "（其他长期资产科目下）特准储备物资",
    "EG01BJ42": "无形及其他资产合计",
    "EG01BJ43": "递延税款借项",
    "EG01BJ44": "资产总计",
    "EG01BJ45": "短期借款",
    "EG01BJ46": "应付票据",
    "EG01BJ47": "应付账款",
    "EG01BJ48": "预收账款",
    "EG01BJ49": "应付工资",
    "EG01BJ50": "应付福利费",
    "EG01BJ51": "应付利润",
    "EG01BJ52": "应交税金",
    "EG01BJ53": "其他应交款",
    "EG01BJ54": "其他应付款",
    "EG01BJ55": "预提费用",
    "EG01BJ56": "预计负债",
    "EG01BJ57": "一年内到期的长期负债",
    "EG01BJ58": "其他流动负债",
    "EG01BJ59": "流动负债合计",
    "EG01BJ60": "长期借款",
    "EG01BJ61": "应付债券",
    "EG01BJ62": "长期应付款",
    "EG01BJ63": "专项应付款",
    "EG01BJ64": "其他长期负债",
    "EG01BJ65": "（其他长期负债科目下）特准储备基金",
    "EG01BJ66": "长期负债合计",
    "EG01BJ67": "递延税款贷项",
    "EG01BJ68": "负债合计",
    "EG01BJ69": "少数股东权益",
    "EG01BJ70": "实收资本",
    "EG01BJ71": "国家资本",
    "EG01BJ72": "集体资本",
    "EG01BJ73": "法人资本",
    "EG01BJ74": "（法人资本科目下）国有法人资本",
    "EG01BJ75": "（法人资本科目下）集体法人资本",
    "EG01BJ76": "个人资本",
    "EG01BJ77": "外商资本",
    "EG01BJ78": "资本公积",
    "EG01BJ79": "盈余公积",
    "EG01BJ80": "（盈余公积科目下）法定盈余公积",
    "EG01BJ81": "（盈余公积科目下）公益金",
    "EG01BJ82": "（盈余公积科目下）补充流动资本",
    "EG01BJ83": "未确认的投资损失",
    "EG01BJ84": "未分配利润",
    "EG01BJ85": "外币报表折算差额",
    "EG01BJ86": "所有者权益合计",
    "EG01BJ87": "负债和所有者权益总计",



    "EG02AI02": "org_code",  # 业务管理机构代码
    "EG02AR01": "report_year",  # 报表年份
    "EG02AD02": "report_type",  # 报表类型
    "EG02AD03": "report_nature",  # 报表类型细分

    "EG02BJ01": "货币资金",
    "EG02BJ02": "交易性金融资产",
    "EG02BJ03": "应收票据",
    "EG02BJ04": "应收账款",
    "EG02BJ05": "预付账款",
    "EG02BJ06": "应收利息",
    "EG02BJ07": "应收股利",
    "EG02BJ08": "其他应收款",
    "EG02BJ09": "存货",
    "EG02BJ10": "一年内到期的非流动资产",
    "EG02BJ11": "其他流动资产",
    "EG02BJ12": "流动资产合计",
    "EG02BJ13": "可供出售的金融资产",
    "EG02BJ14": "持有至到期投资",
    "EG02BJ15": "长期股权投资",
    "EG02BJ16": "长期应收款",
    "EG02BJ17": "投资性房地产",
    "EG02BJ18": "固定资产",
    "EG02BJ19": "在建工程",
    "EG02BJ20": "工程物资",
    "EG02BJ21": "固定资产清理",
    "EG02BJ22": "生产性生物资产",
    "EG02BJ23": "油气资产",
    "EG02BJ24": "无形资产",
    "EG02BJ25": "开发支出",
    "EG02BJ26": "商誉",
    "EG02BJ27": "长期待摊费用",
    "EG02BJ28": "递延所得税资产",
    "EG02BJ29": "其他非流动资产",
    "EG02BJ30": "非流动资产合计",
    "EG02BJ31": "资产总计",
    "EG02BJ32": "短期借款",
    "EG02BJ33": "交易性金融负债",
    "EG02BJ34": "应付票据",
    "EG02BJ35": "应付账款",
    "EG02BJ36": "预收账款",
    "EG02BJ37": "应付利息",
    "EG02BJ38": "应付职工薪酬",
    "EG02BJ39": "应交税费",
    "EG02BJ40": "应付股利",
    "EG02BJ41": "其他应付款",
    "EG02BJ42": "一年内到期的非流动负债",
    "EG02BJ43": "其他流动负债",
    "EG02BJ44": "流动负债合计",
    "EG02BJ45": "长期借款",
    "EG02BJ46": "应付债券",
    "EG02BJ47": "长期应付款",
    "EG02BJ48": "专项应付款",
    "EG02BJ49": "预计负债",
    "EG02BJ50": "递延所得税负债",
    "EG02BJ51": "其他非流动负债",
    "EG02BJ52": "非流动负债合计",
    "EG02BJ53": "负债合计",
    "EG02BJ54": "实收资本（或股本）",
    "EG02BJ55": "资本公积",
    "EG02BJ56": "减：库存股",
    "EG02BJ57": "盈余公积",
    "EG02BJ58": "未分配利润",
    "EG02BJ59": "所有者权益合计",
    "EG02BJ60": "负债和所有者权益合计",



    "EG03AI02": "org_code",  # 业务管理机构代码
    "EG03AR01": "report_year",  # 报表年份
    "EG03AD02": "report_type",  # 报表类型
    "EG03AD03": "report_nature",  # 报表类型细分

    "EG03BJ01": "主营业务收入",
    "EG03BJ02": "（主营业务收入科目下）出口产品销售收入",
    "EG03BJ03": "（主营业务收入科目下）进口产品销售收入",
    "EG03BJ04": "销售折扣与折让",
    "EG03BJ05": "主营业务收入净额",
    "EG03BJ06": "主营业务成本",
    "EG03BJ07": "（主营业务成本科目下）出口产品销售成本",
    "EG03BJ08": "主营业务税金及附加",
    "EG03BJ09": "经营费用",
    "EG03BJ10": "其他（业务成本）",
    "EG03BJ11": "递延收益",
    "EG03BJ12": "代购代销收入",
    "EG03BJ13": "其他（收入）",
    "EG03BJ14": "主营业务利润",
    "EG03BJ15": "其他业务利润",
    "EG03BJ16": "营业费用",
    "EG03BJ17": "管理费用",
    "EG03BJ18": "财务费用",
    "EG03BJ19": "其他（费用）",
    "EG03BJ20": "营业利润",
    "EG03BJ21": "投资收益",
    "EG03BJ22": "期货收益",
    "EG03BJ23": "补贴收入",
    "EG03BJ24": "（补贴收入科目下）补贴前亏损的企业补贴收入",
    "EG03BJ25": "营业外收入",
    "EG03BJ26": "（营业外收入科目下）处置固定资产净收益",
    "EG03BJ27": "（营业外收入科目下）非货币性交易收益",
    "EG03BJ28": "（营业外收入科目下）出售无形资产收益",
    "EG03BJ29": "（营业外收入科目下）罚款净收入",
    "EG03BJ30": "其他（利润）",
    "EG03BJ31": "（其他科目下）用以前年度含量工资节余弥补利润",
    "EG03BJ32": "营业外支出",
    "EG03BJ33": "（营业外支出科目下）处置固定资产净损失",
    "EG03BJ34": "（营业外支出科目下）债务重组损失",
    "EG03BJ35": "（营业外支出科目下）罚款支出",
    "EG03BJ36": "（营业外支出科目下）捐赠支出",
    "EG03BJ37": "其他支出",
    "EG03BJ38": "（其他支出）结转的含量工资包干节余",
    "EG03BJ39": "利润总额",
    "EG03BJ40": "所得税",
    "EG03BJ41": "少数股东损益",
    "EG03BJ42": "未确认的投资损失",
    "EG03BJ43": "净利润",
    "EG03BJ44": "年初未分配利润",
    "EG03BJ45": "盈余公积补亏",
    "EG03BJ46": "其他调整因素",
    "EG03BJ47": "可供分配的利润",
    "EG03BJ48": "单项留用的利润",
    "EG03BJ49": "补充流动资本",
    "EG03BJ50": "提取法定盈余公积",
    "EG03BJ51": "提取法定公益金",
    "EG03BJ52": "提取职工奖励及福利基金",
    "EG03BJ53": "提取储备基金",
    "EG03BJ54": "提取企业发展基金",
    "EG03BJ55": "利润归还投资",
    "EG03BJ56": "（可供分配的利润科目下）其他",
    "EG03BJ57": "可供投资者分配的利润",
    "EG03BJ58": "应付优先股股利",
    "EG03BJ59": "提取任意盈余公积",
    "EG03BJ60": "应付普通股股利",
    "EG03BJ61": "转作资本的普通股股利",
    "EG03BJ62": "（可供投资者分配的利润科目下）其他",
    "EG03BJ63": "未分配利润",
    "EG03BJ64": "（未分配利润科目下）应由以后年度税前利润弥补的亏损",
    # 财务报表
    "EG04AI02": "org_code",  # 业务管理机构代码
    "EG04AR01": "report_year",  # 报表年份
    "EG04AD02": "report_type",  # 报表类型
    "EG04AD03": "report_nature",  # 报表类型细分

    "EG04BJ01": "营业收入",
    "EG04BJ02": "营业成本",
    "EG04BJ03": "营业税金及附加",
    "EG04BJ04": "销售费用",
    "EG04BJ05": "管理费用",
    "EG04BJ06": "财务费用",
    "EG04BJ07": "资产减值损失",
    "EG04BJ08": "公允价值变动净收益",
    "EG04BJ09": "投资净收益",
    "EG04BJ10": "对联营企业和合营企业的投资收益",
    "EG04BJ11": "营业利润",
    "EG04BJ12": "营业外收入",
    "EG04BJ13": "营业外支出",
    "EG04BJ14": "非流动资产损失（其中：非流动资产处置损失）",
    "EG04BJ15": "利润总额",
    "EG04BJ16": "所得税费用",
    "EG04BJ17": "净利润",
    "EG04BJ18": "基本每股收益",
    "EG04BJ19": "稀释每股收益",

    "EG05AI02": "org_code",  # 业务管理机构代码
    "EG05AR01": "report_year",  # 报表年份
    "EG05AD02": "report_type",  # 报表类型
    "EG05AD03": "report_nature",  # 报表类型细分

    "EG05BJ01": "销售商品和提供劳务收到的现金",
    "EG05BJ02": "收到的税费返还",
    "EG05BJ03": "收到的其他与经营活动有关的现金",
    "EG05BJ04": "经营活动现金流入小计",
    "EG05BJ05": "购买商品、接受劳务支付的现金",
    "EG05BJ06": "支付给职工以及为职工支付的现金",
    "EG05BJ07": "支付的各项税费",
    "EG05BJ08": "支付的其他与经营活动有关的现金",
    "EG05BJ09": "经营活动现金流出小计",
    "EG05BJ10": "经营活动产生的现金流量净额",
    "EG05BJ11": "收回投资所收到的现金",
    "EG05BJ12": "取得投资收益所收到的现金",
    "EG05BJ13": "处置固定资产无形资产和其他长期资产所收回的现金净额",
    "EG05BJ14": "收到的其他与投资活动有关的现金",
    "EG05BJ15": "投资活动现金流入小计",
    "EG05BJ16": "购建固定资产无形资产和其他长期资产所支付的现金",
    "EG05BJ17": "投资所支付的现金",
    "EG05BJ18": "支付的其他与投资活动有关的现金",
    "EG05BJ19": "投资活动现金流出小计",
    "EG05BJ20": "投资活动产生的现金流量净额",
    "EG05BJ21": "吸收投资所收到的现金",
    "EG05BJ22": "借款所收到的现金",
    "EG05BJ23": "收到的其他与筹资活动有关的现金",
    "EG05BJ24": "筹资活动现金流入小计",
    "EG05BJ25": "偿还债务所支付的现金",
    "EG05BJ26": "分配股利、利润或偿付利息所支付的现金",
    "EG05BJ27": "支付的其他与筹资活动有关的现金",
    "EG05BJ28": "筹资活动现金流出小计",
    "EG05BJ29": "筹集活动产生的现金流量净额",
    "EG05BJ30": "汇率变动对现金的影响",
    "EG05BJ31": "现金及现金等价物净增加额",
    "EG05BJ32": "净利润",
    "EG05BJ33": "计提的资产减值准备",
    "EG05BJ34": "固定资产拆旧",
    "EG05BJ35": "无形资产摊销",
    "EG05BJ36": "长期待摊费用摊销",
    "EG05BJ37": "待摊费用减少",
    "EG05BJ38": "预提费用增加",
    "EG05BJ39": "处置固定资产无形资产和其他长期资产的损失",
    "EG05BJ40": "固定资产报废损失",
    "EG05BJ41": "财务费用",
    "EG05BJ42": "投资损失",
    "EG05BJ43": "递延税款贷项",
    "EG05BJ44": "存货的减少",
    "EG05BJ45": "经营性应收项目的减少",
    "EG05BJ46": "经营性应付项目的增加",
    "EG05BJ47": "（净利润调节为经营活动现金流量科目下）其他",
    "EG05BJ48": "经营活动产生的现金流量净额",
    "EG05BJ49": "债务转为资本",
    "EG05BJ50": "一年内到期的可转换公司债券",
    "EG05BJ51": "融资租入固定资产",
    "EG05BJ52": "（不涉及现金收支的投资和筹资活动科目下）其他",
    "EG05BJ53": "现金的期末余额",
    "EG05BJ54": "现金的期初余额",
    "EG05BJ55": "现金等价物的期末余额",
    "EG05BJ56": "现金等价物的期初余额",
    "EG05BJ57": "现金及现金等价物净增加额",

    "EG06AI02": "org_code",  # 业务管理机构代码
    "EG06AR01": "report_year",  # 报表年份
    "EG06AD02": "report_type",  # 报表类型
    "EG06AD03": "report_nature",  # 报表类型细分

    "EG06BJ01": "销售商品和提供劳务收到的现金",
    "EG06BJ02": "收到的税费返还",
    "EG06BJ03": "收到其他与经营活动有关的现金",
    "EG06BJ04": "经营活动现金流入小计",
    "EG06BJ05": "购买商品、接受劳务支付的现金",
    "EG06BJ06": "支付给职工以及为职工支付的现金",
    "EG06BJ07": "支付的各项税费",
    "EG06BJ08": "支付其他与经营活动有关的现金",
    "EG06BJ09": "经营活动现金流出小计",
    "EG06BJ10": "经营活动产生的现金流量净额",
    "EG06BJ11": "收回投资所收到的现金",
    "EG06BJ12": "取得投资收益所收到的现金",
    "EG06BJ13": "处置固定资产无形资产和其他长期资产所收回的现金净额",
    "EG06BJ14": "处置子公司及其他营业单位收到的现金净额",
    "EG06BJ15": "收到其他与投资活动有关的现金",
    "EG06BJ16": "投资活动现金流入小计",
    "EG06BJ17": "购建固定资产无形资产和其他长期资产所支付的现金",
    "EG06BJ18": "投资所支付的现金",
    "EG06BJ19": "取得子公司及其他营业单位支付的现金净额",
    "EG06BJ20": "支付其他与投资活动有关的现金",
    "EG06BJ21": "投资活动现金流出小计",
    "EG06BJ22": "投资活动产生的现金流量净额",
    "EG06BJ23": "吸收投资收到的现金",
    "EG06BJ24": "取得借款收到的现金",
    "EG06BJ25": "收到其他与筹资活动有关的现金",
    "EG06BJ26": "筹资活动现金流入小计",
    "EG06BJ27": "偿还债务所支付的现金",
    "EG06BJ28": "分配股利、利润或偿付利息所支付的现金",
    "EG06BJ29": "支付其他与筹资活动有关的现金",
    "EG06BJ30": "筹资活动现金流出小计",
    "EG06BJ31": "筹集活动产生的现金流量净额",
    "EG06BJ32": "汇率变动对现金及现金等价物的影响",
    "EG06BJ33": "现金及现金等价物净增加额",
    "EG06BJ34": "期初现金及现金等价物余额",
    "EG06BJ35": "期末现金及现金等价物余额",
    "EG06BJ36": "净利润",
    "EG06BJ37": "资产减值准备",
    "EG06BJ38": "固定资产折旧、油气资产折耗、生产性生物资产折旧",
    "EG06BJ39": "无形资产摊销",
    "EG06BJ40": "长期待摊费用摊销",
    "EG06BJ41": "待摊费用减少",
    "EG06BJ42": "预提费用增加",
    "EG06BJ43": "处置固定资产无形资产和其他长期资产的损失",
    "EG06BJ44": "固定资产报废损失",
    "EG06BJ45": "公允价值变动损失",
    "EG06BJ46": "财务费用",
    "EG06BJ47": "投资损失",
    "EG06BJ48": "递延所得税资产减少",
    "EG06BJ49": "递延所得税负债增加",
    "EG06BJ50": "存货的减少",
    "EG06BJ51": "经营性应收项目的减少",
    "EG06BJ52": "经营性应付项目的增加",
    "EG06BJ53": "（净利润调节为经营活动现金流量科目下）其他",
    "EG06BJ54": "经营活动产生的现金流量净额",
    "EG06BJ55": "债务转为资本",
    "EG06BJ56": "一年内到期的可转换公司债券",
    "EG06BJ57": "融资租入固定资产",
    "EG06BJ58": "现金的期末余额",
    "EG06BJ59": "现金的期初余额",
    "EG06BJ60": "现金等价物的期末余额",
    "EG06BJ61": "现金等价物的期初余额",
    "EG06BJ62": "现金及现金等价物净增加额",
    "EG06BJ63": "（不涉及现金收支的投资和筹资活动科目下）其他",

    "EG07AI02": "org_code",  # 业务管理机构代码
    "EG07AR01": "report_year",  # 报表年份
    "EG07AD02": "report_type",  # 报表类型
    "EG07AD03": "report_nature",  # 报表类型细分

    "EG07BJ01": "现金",
    "EG07BJ02": "银行存款",
    "EG07BJ03": "应收票据",
    "EG07BJ04": "应收账款",
    "EG07BJ05": "预付账款",
    "EG07BJ06": "其他应收款",
    "EG07BJ07": "材料",
    "EG07BJ08": "产成品",
    "EG07BJ09": "对外投资",
    "EG07BJ10": "固定资产",
    "EG07BJ11": "无形资产",
    "EG07BJ12": "资产合计",
    "EG07BJ13": "拨出经费",
    "EG07BJ14": "拨出专款",
    "EG07BJ15": "专款支出",
    "EG07BJ16": "事业支出",
    "EG07BJ17": "经营支出",
    "EG07BJ18": "成本费用",
    "EG07BJ19": "销售税金",
    "EG07BJ20": "上缴上级支出",
    "EG07BJ21": "对附属单位补助",
    "EG07BJ22": "结转自筹基建",
    "EG07BJ23": "支出合计",
    "EG07BJ24": "资产部类总计",
    "EG07BJ25": "借记款项",
    "EG07BJ26": "应付票据",
    "EG07BJ27": "应付账款",
    "EG07BJ28": "预收账款",
    "EG07BJ29": "其他应付款",
    "EG07BJ30": "应缴预算款",
    "EG07BJ31": "应缴财政专户款",
    "EG07BJ32": "应交税金",
    "EG07BJ33": "负债合计",
    "EG07BJ34": "事业基金",
    "EG07BJ35": "一般基金",
    "EG07BJ36": "投资基金",
    "EG07BJ37": "固定基金",
    "EG07BJ38": "专用基金",
    "EG07BJ39": "事业结余",
    "EG07BJ40": "经营结余",
    "EG07BJ41": "净资产合计",
    "EG07BJ42": "财政补助收入",
    "EG07BJ43": "上级补助收入",
    "EG07BJ44": "拨入专款",
    "EG07BJ45": "事业收入",
    "EG07BJ46": "经营收入",
    "EG07BJ47": "附属单位缴款",
    "EG07BJ48": "其他收入",
    "EG07BJ49": "收入合计",
    "EG07BJ50": "负债部类总计",

    "EG08AI02": "org_code",  # 业务管理机构代码
    "EG08AR01": "report_year",  # 报表年份
    "EG08AD02": "report_type",  # 报表类型
    "EG08AD03": "report_nature",  # 报表类型细分

    "EG08BJ01": "货币资金",
    "EG08BJ02": "短期投资",
    "EG08BJ03": "财政应返还额度",
    "EG08BJ04": "应收票据",
    "EG08BJ05": "应收账款",
    "EG08BJ06": "预付账款",
    "EG08BJ07": "其他应收款",
    "EG08BJ08": "存货",
    "EG08BJ09": "其他流动资产",
    "EG08BJ10": "流动资产合计",
    "EG08BJ11": "长期投资",
    "EG08BJ12": "固定资产",
    "EG08BJ13": "固定资产原价",
    "EG08BJ14": "累计折旧",
    "EG08BJ15": "在建工程",
    "EG08BJ16": "无形资产",
    "EG08BJ17": "无形资产原价",
    "EG08BJ18": "累计摊销",
    "EG08BJ19": "待处置资产损溢",
    "EG08BJ20": "非流动资产合计",
    "EG08BJ21": "资产总计",
    "EG08BJ22": "短期借款",
    "EG08BJ23": "应缴税费",
    "EG08BJ24": "应缴国库款",
    "EG08BJ25": "应缴财政专户款",
    "EG08BJ26": "应付职工薪酬",
    "EG08BJ27": "应付票据",
    "EG08BJ28": "应付账款",
    "EG08BJ29": "预收账款",
    "EG08BJ30": "其他应付款",
    "EG08BJ31": "其他流动负债",
    "EG08BJ32": "流动负债合计",
    "EG08BJ33": "长期借款",
    "EG08BJ34": "长期应付款",
    "EG08BJ35": "非流动负债合计",
    "EG08BJ36": "负债合计",
    "EG08BJ37": "事业基金",
    "EG08BJ38": "非流动资产基金",
    "EG08BJ39": "专用基金",
    "EG08BJ40": "财政补助结转",
    "EG08BJ41": "财政补助结余",
    "EG08BJ42": "非财政补助结转",
    "EG08BJ43": "非财政补助结余",
    "EG08BJ44": "事业结余",
    "EG08BJ45": "经营结余",
    "EG08BJ46": "净资产合计",
    "EG08BJ47": "负债和净资产总计",

    "EG09AI02": "org_code",  # 业务管理机构代码
    "EG09AR01": "report_year",  # 报表年份
    "EG09AD02": "report_type",  # 报表类型
    "EG09AD03": "report_nature",  # 报表类型细分

    "EG09BJ01": "财政补助收入",
    "EG09BJ02": "上级补助收入",
    "EG09BJ03": "附属单位缴款",
    "EG09BJ04": "事业收入",
    "EG09BJ05": "预算外资金收入",
    "EG09BJ06": "其他收入",
    "EG09BJ07": "事业收入小计",
    "EG09BJ08": "经营收入",
    "EG09BJ09": "经营收入小计",
    "EG09BJ10": "拨入专款",
    "EG09BJ11": "拨入专款小计",
    "EG09BJ12": "收入总计",
    "EG09BJ13": "拨出经费",
    "EG09BJ14": "上缴上级支出",
    "EG09BJ15": "对附属单位补助",
    "EG09BJ16": "事业支出",
    "EG09BJ17": "财政补助支出",
    "EG09BJ18": "预算外资金支出",
    "EG09BJ19": "销售税金",
    "EG09BJ20": "结转自筹基建",
    "EG09BJ21": "事业支出小计",
    "EG09BJ22": "经营支出",
    "EG09BJ23": "销售税金",
    "EG09BJ24": "经营支出小计",
    "EG09BJ25": "拨出专款",
    "EG09BJ26": "专款支出",
    "EG09BJ27": "专款小计",
    "EG09BJ28": "支出总计",
    "EG09BJ29": "事业结余",
    "EG09BJ30": "正常收入结余",
    "EG09BJ31": "收回以前年度事业支出",
    "EG09BJ32": "经营结余",
    "EG09BJ33": "以前年度经营亏损",
    "EG09BJ34": "结余分配",
    "EG09BJ35": "应交所得税",
    "EG09BJ36": "提取专用基金",
    "EG09BJ37": "转入事业基金",
    "EG09BJ38": "其他结余分配",

    "EG10AI02": "org_code",  # 业务管理机构代码
    "EG10AR01": "report_year",  # 报表年份
    "EG10AD02": "report_type",  # 报表类型
    "EG10AD03": "report_nature",  # 报表类型细分

    "EG10BJ01": "本期财政补助结转结余",
    "EG10BJ02": "财政补助收入",
    "EG10BJ03": "事业支出（财政补助支出）",
    "EG10BJ04": "本期事业结转结余",
    "EG10BJ05": "事业类收入",
    "EG10BJ06": "事业收入",
    "EG10BJ07": "上级补助收入",
    "EG10BJ08": "附属单位上缴收入",
    "EG10BJ09": "其他收入",
    "EG10BJ10": "（其他收入科目下）捐赠收入",
    "EG10BJ11": "事业类支出",
    "EG10BJ12": "事业支出（非财政补助支出）",
    "EG10BJ13": "上缴上级支出",
    "EG10BJ14": "对附属单位补助支出",
    "EG10BJ15": "其他支出",
    "EG10BJ16": "本期经营结余",
    "EG10BJ17": "经营收入",
    "EG10BJ18": "经营支出",
    "EG10BJ19": "弥补以前年度亏损后的经营结余",
    "EG10BJ20": "本年非财政补助结转结余",
    "EG10BJ21": "非财政补助结转",
    "EG10BJ22": "本年非财政补助结余",
    "EG10BJ23": "应缴企业所得税",
    "EG10BJ24": "提取专用基金",
    "EG10BJ25": "转入事业基金"
}


# 汇总信息
loan_type_mapping = {
    "1": "中长期借款",
    "2": "短期借款",
    "3": "循环透支",
    "4": "贴现",
    "0": "合计"
}

status_type_mapping = {
    "1": "正常类",
    "2": "关注类",
    "3": "不良类",
    "0": "合计"
}

# 财务报表
financial_table_mapping = {
    "EG01": "企业资产负债表（2002版）", 
    "EG02": "企业资产负债表（2007版）", 
    "EG03": "企业利润及利润分配表（2002版）", 
    "EG04": "企业利润及利润分配表（2007版）", 
    "EG05": "企业现金流量表（2002版）", 
    "EG06": "企业现金流量表（2007版）", 
    "EG07": "事业单位资产负债表（1997版）", 
    "EG08": "事业单位资产负债表（2013版）", 
    "EG09": "事业单位收入支出表（1997版）", 
    "EG10": "事业单位收入支出表（2013版）"
}

account_type_mapping = {
    "有追索权的商业承兑汇票贴现": "贴现",
    "有追索权的银行承兑汇票贴现": "贴现",
    "其他融资性担保": "银行保函及其他业务",
    "履约担保": "银行保函及其他业务",
    "票据承兑担保": "银行保函及其他业务",
    "融资类银行保函": "银行保函及其他业务",
    "贷款保证保险": "银行保函及其他业务",
    "贷款担保": "银行保函及其他业务",
    "贸易融资担保": "银行保函及其他业务",
    "非融资性担保": "银行保函及其他业务",
    "非融资类银行保函": "银行保函及其他业务",
    "信用证": "银行承兑汇票和信用证",
    "银行承兑汇票": "银行承兑汇票和信用证"
}
