# 字段映射表
column_mapping = {
    # 报告头
    "PA01AI01": "report_no",  # 报告编号
    "PA01AR01": "report_time",  # 报告时间
    "PA01BQ01": "name",  # 被查询者姓名
    "PA01BD01": "certificate_type",  # 被查询者证件类型
    "PA01BI01": "certificate_no",  # 被查询者证件号码
    "PA01BI02": "queryer",  # 查询机构代码
    "PA01BD02": "query_reason",  # 查询原因代码
    # 其他证件信息
    'PA01CD01': 'cert_type',  # 证件类型
    'PA01CI01': 'cert_no',  # 证件号码
    # 防欺诈警示信息
    "PA01DQ02": "warn_content",  # 防欺诈警示内容
    "PA01DR01": "effective_date",  # 防欺诈警示生效日期
    "PA01DR02": "expiry_date",  # 防欺诈警示截止日期
    # 身份信息-基本概况信息
    "PB01AD01": "sex",  # 性别
    "PB01AR01": "birthday",  # 出生日期
    "PB01AD02": "education",  # 学历
    "PB01AD03": "jhi_degree",  # 学位
    "PB01AD04": "employment",  # 就业状况
    "PB01AQ01": "email",  # 电子邮箱
    "PB01AQ02": "communication_address",  # 通讯地址
    "PB01AD05": "nationality",  # 国籍
    "PB01AQ03": "residence_address",  # 户籍地址
    # 身份信息-手机号信息
    "PB01BQ01": "phone",  # 手机号码
    "PB01BR01": "update_time",  # 信息更新日期
    # 婚姻信息
    "PB020D01": "marriage_status",  # 婚姻状况
    "PB020Q01": "spouse_name",  # 配偶姓名
    "PB020D02": "spouse_certificate_type",  # 配偶证件类型
    "PB020I01": "spouse_certificate_no",  # 配偶证件号码
    "PB020Q02": "spouse_work_unit",  # 配偶工作单位
    "PB020Q03": "spouse_mobile_no",  # 配偶联系电话
    # 居住信息
    "PB030D01": "live_address_type",  # 居住状况
    "PB030Q01": "live_address",  # 居住地址
    "PB030Q02": "phone",  # 住宅电话
    "PB030R01": "update_time",  # 信息更新日期
    # 工作信息
    "PB040Q01": "work_unit",  # 工作单位
    "PB040D02": "work_type",  # 单位性质
    "PB040D03": "industry",  # 行业
    "PB040Q02": "work_address",  # 单位地址
    "PB040Q03": "work_phone",  # 单位电话
    "PB040D04": "profession",  # 职业
    "PB040D05": "duty",  # 职务
    "PB040D06": "duty_title",  # 职称
    "PB040R01": "enter_date",  # 进入本单位年份
    "PB040R02": "update_time",  # 信息更新日期
    # 分数解读
    "PC010Q01": "score",  # 数字解读
    "PC010Q02": "position",  # 相对位置
    "PC010D01": "desc_content",  # 分数说明
    # 信贷交易信息概要
    "PC02AD01": "biz_sub_type",  # 业务类型
    "PC02AD02": "biz_type",  # 业务大类
    "PC02AS03": "biz_counts",  # 账户数
    "PC02AR01": "biz_first_month",  # 首笔业务发放月份
    # 信贷逾期信息概要
    "PC02BD01": "default_subtype",  # 业务类型
    "PC02BS03": "default_count",  # 账户数
    "PC02BJ02": "default_balance",  # 余额
    "PC02CS01": "default_count",  # 账户数
    "PC02CJ01": "default_balance",  # 余额
    "PC02DD01": "default_subtype",  # 账户类型
    "PC02DS02": "default_count",  # 账户数
    "PC02DS03": "default_month",  # 月份数
    "PC02DJ01": "max_overdue_sum",  # 单月最高逾期（透支）总额
    "PC02DS04": "max_overdue_month",  # 最长逾期（透支）月数
    # 非循环贷信息概要
    "PC02ES01": "non_revolloan_org_count",  # 管理机构数
    "PC02ES02": "non_revolloan_accountno",  # 账户数
    "PC02EJ01": "non_revolloan_totalcredit",  # 授信总额
    "PC02EJ02": "non_revolloan_balance",  # 余额
    "PC02EJ03": "non_revolloan_repayin_6_m",  # 最近 6 个月平均应还款
    # 循环贷下分帐户信息概要
    "PC02FS01": "revolcredit_org_count",  # 管理机构数
    "PC02FS02": "revolcredit_account",  # 账户数
    "PC02FJ01": "revolcredit_totalcredit",  # 授信总额
    "PC02FJ02": "revolcredit_balance",  # 余额
    "PC02FJ03": "revolcredit_repayin_6_m",  # 最近 6 个月平均应还款
    # 循环贷信息概要
    "PC02GS01": "revolloan_org_count",  # 管理机构数
    "PC02GS02": "revolloan_account_no",  # 账户数
    "PC02GJ01": "revolloan_totalcredit",  # 授信总额
    "PC02GJ02": "revolloan_balance",  # 余额
    "PC02GJ03": "revolloan_repayin_6_m",  # 最近 6 个月平均应还款
    # 贷记卡信息概要
    "PC02HS01": "undestroy_org_count",  # 发卡机构数
    "PC02HS02": "undestroy_count",  # 账户数
    "PC02HJ01": "undestroy_limit",  # 授信总额
    "PC02HJ02": "undestory_max_limit",  # 单家行最高授信额
    "PC02HJ03": "undestory_min_limt",  # 单家行最低授信额
    "PC02HJ04": "undestory_used_limit",  # 已用额度
    "PC02HJ05": "undestory_avg_use",  # 最近 6 个月平均使用额度
    # 准贷记卡信息概要
    "PC02IS01": "undestory_semi_org_count",  # 发卡机构数
    "PC02IS02": "undestory_semi_count",  # 账户数
    "PC02IJ01": "undestory_semi_limit",  # 授信总额
    "PC02IJ02": "undestory_semi_max_limit",  # 单家行最高授信额
    "PC02IJ03": "undestory_semi_min_limt",  # 单家行最低授信额
    "PC02IJ04": "undestory_semi_overdraft",  # 透支余额
    "PC02IJ05": "undestory_semi_avg_overdraft",  # 最近 6 个月平均透支余额
    # 为个人担保信息概要
    "11PC02KS02": "ind_guarantee_count",  # 账户数
    "11PC02KJ01": "ind_guarantee_sum",  # 还款责任金额
    "11PC02KJ02": "ind_guarantee_balance",  # 余额
    # 为个人其他相关还款责任信息概要
    "19PC02KS02": "ind_repay_count",  # 账户数
    "19PC02KJ01": "ind_repay_sum",  # 还款责任金额
    "19PC02KJ02": "ind_repay_balance",  # 余额
    # 为企业担保信息概要
    "21PC02KS02": "ent_guarantee_count",  # 账户数
    "21PC02KJ01": "ent_guarantee_sum",  # 还款责任金额
    "21PC02KJ02": "ent_guarantee_balance",  # 余额
    # 为企业其他相关还款责任信息概要
    "29PC02KS02": "ent_repay_count",  # 账户数
    "29PC02KJ01": "ent_repay_sum",  # 还款责任金额
    "29PC02KJ02": "ent_repay_balance",  # 余额
    # 后付费信息概要
    "PC030D01": "noncredit_type",  # 后付费业务类型
    "PC030S02": "noncredit_count",  # 欠费账户数
    "PC030J01": "noncredit_sum",  # 欠费金额
    # 公共信息概要
    "PC040D01": "pub_type",  # 公共信息类型
    "PC040S02": "pub_count",  # 记录数
    "PC040J01": "pub_sum",  # 涉及金额
    # 查询记录概要
    "PC05AR01": "last_query_time",  # 上一次查询日期
    "PC05AD01": "last_query_org1",  # 上一次查询机构机构类型
    "PC05AI01": "last_query_org2",  # 上一次查询机构代码
    "PC05AQ01": "last_query_type",  # 上一次查询原因
    "PC05BS01": "loan_org_1",  # 最近 1 个月内的查询机构数（贷款审批）
    "PC05BS02": "credit_org_1",  # 最近 1 个月内的查询机构数（信用卡审批）
    "PC05BS03": "loan_times_1",  # 最近 1 个月内的查询次数（贷款审批）
    "PC05BS04": "credit_times_1",  # 最近 1 个月内的查询次数（信用卡审批）
    "PC05BS05": "self_times_1",  # 最近 1 个月内的查询次数（本人查询）
    "PC05BS06": "loan_times_2",  # 最近 2 年内的查询次数（贷后管理）
    "PC05BS07": "guarantee_times_2",  # 最近 2 年内的查询次数（担保资格审查）
    "PC05BS08": "agreement_times_2",  # 最近 2 年内的查询次数（特约商户实名审查）
    # 信贷交易信息明细
    # 借贷基本信息
    "PD01AD01": "account_type",  # 账户类型
    "PD01AD02": "account_org1",  # 业务管理机构类型
    "PD01AI02": "account_org2",  # 业务管理机构代码
    # "PD01AI03": "account_mark",  # 账户标识
    "PD01AI04": "credit_limit_no",  # 授信协议编号
    "PD01AD03": "loan_type",  # 业务种类
    "PD01AR01": "loan_date",  # 开立日期
    "PD01AD04": "currency",  # 币种
    "PD01AJ01": "loan_amount1",  # 借款金额
    "PD01AJ02": "loan_amount2",  # 账户授信额度
    "PD01AJ03": "credit_share_amt",  # 共享授信额度
    "PD01AR02": "end_date",  # 到期日期
    "PD01AD05": "loan_repay_type",  # 还款方式
    "PD01AD06": "repay_frequency",  # 还款频率
    "PD01AS01": "repay_period",  # 还款期数
    "PD01AD07": "loan_guarantee_type",  # 担保方式
    "PD01AD08": "account_mark",  # 账户标识存储贷款发放形式
    "PD01AD09": "joint_loan_mark",  # 共同借款标志
    # 最新表现信息
    "PD01BD01": "loan_status1",  # 账户状态
    "PD01BR01": "loan_status_time1",  # 关闭日期
    "PD01BR04": "loan_status_time2",  # 转出月份
    "PD01BJ01": "latest_loan_balance",  # 余额
    "PD01BR02": "latest_replay_date",  # 最近一次还款日期
    "PD01BJ02": "latest_replay_amount",  # 最近一次还款金额
    "PD01BD03": "latest_category",  # 五级分类
    "PD01BD04": "latest_repay_status",  # 还款状态
    # 最近一次月度表现信息
    "PD01CR01": "expiry_date",  # 月份
    "PD01CD01": "loan_status2",  # 账户状态
    "PD01CJ01": "loan_balance",  # 余额
    "PD01CJ02": "quota_used",  # 已用额度
    "PD01CJ03": "large_scale_balance",  # 未出单的大额专项分期余额
    "PD01CD02": "category",  # 五级分类
    "PD01CS01": "surplus_repay_period",  # 剩余还款期数
    "PD01CR02": "plan_repay_date",  # 结算/应还款日
    "PD01CJ04": "repay_amount",  # 本月应还款
    "PD01CJ05": "amout_replay_amount",  # 本月实还款
    "PD01CR03": "lately_replay_date",  # 最近一次还款日期
    "PD01CS02": "overdue_period",  # 当前逾期期数
    "PD01CJ06": "overdue_amount",  # 当前逾期总额
    "PD01CJ07": "overdue_31_principal",  # 逾期 31—60 天未还本金
    "PD01CJ08": "overdue_61_principal",  # 逾期 61－90 天未还本金
    "PD01CJ09": "overdue_91_principal",  # 逾期 91－180 天未还本金
    "PD01CJ10": "overdue_180_principal1",  # 逾期 180 天以上未还本金
    "PD01CJ11": "overdue_180_principal2",  # 透支 180 天以上未付余额
    "PD01CJ12": "avg_overdraft_balance_61",  # 最近 6 个月平均使用额度
    "PD01CJ13": "avg_overdraft_balance_62",  # 最近 6 个月平均透支余额
    "PD01CJ14": "max_limit1",  # 最大使用额度
    "PD01CJ15": "max_limit2",  # 最大透支余额
    # 最近五年还款记录明细
    "PD01ER03": "jhi_year",  # 年份
    "PD01ED01": "status",  # 还款状态
    "PD01EJ01": "repayment_amt",  # 逾期（透支）总额
    "PD01ER04": "month",  # 月份
    # 特殊交易记录明细
    "PD01FD01": "special_type",  # 特殊交易类型
    "PD01FR01": "special_date",  # 特殊交易发生日期
    "PD01FS02": "special_month",  # 到期日期变更月数
    "PD01FJ01": "special_money",  # 特殊交易发生金额
    "PD01FQ01": "special_comment",  # 特殊交易明细记录
    # 大额专项分期记录明细
    "PD01HJ01": "large_scale_quota",  # 大额专项分期额度
    "PD01HR01": "effective_date",  # 分期额度生效日期
    "PD01HR02": "end_date",  # 分期额度到期日期
    "PD01HJ02": "usedsum",  # 已用分期金额
    # 授信协议编号
    "PD02AD01": "account_org1",  # 业务管理机构类型
    "PD02AI02": "account_org2",  # 业务管理机构
    "PD02AI03": "account_mark",  # 授信协议标识
    "PD02AD02": "credit_purpose",  # 授信额度用途
    "PD02AJ01": "loan_amount",  # 授信额度
    "PD02AD03": "currency",  # 币种
    "PD02AR01": "loan_date",  # 生效日期
    "PD02AR02": "end_date",  # 到期日期
    "PD02AJ04": "quota_used",  # 已用额度
    "PD02AJ03": "credit_limit",  # 授信限额
    "PD02AI04": "credit_limit_no",  # 授信限额编号
    # 相关还款责任
    "PD03AD08": "respon_object",  # 主借款人身份类别
    "PD03AD01": "account_org1",  # 业务管理机构类型
    "PD03AQ01": "account_org2",  # 业务管理机构
    "PD03AD02": "loan_type",  # 业务种类
    "PD03AR01": "loan_date",  # 开立日期
    "PD03AR02": "end_date",  # 到期日期
    "PD03AD03": "respon_type",  # 相关还款责任人类型
    "PD03AQ02": "guarantee_no",  # 保证合同编号
    "PD03AJ01": "loan_amount",  # 相关还款责任金额
    "PD03AD04": "currency",  # 币种
    "PD03AJ02": "loan_balance",  # 余额
    "PD03AD05": "category",  # 五级分类
    "PD03AD07": "account_status",  # 还款状态
    "PD03AS01": "overdue_period",  # 逾期月数
    # 后付费记录
    "PE01AD01": "biz_type",  # 后付费账户类型
    "PE01AQ01": "biz_org",  # 机构名称
    "PE01AR01": "biz_start_date",  # 业务开通日期
    "PE01AD03": "current_payment_status",  # 当前缴费状态
    "PE01AJ01": "current_arrears_amt",  # 当前欠费金额
    "PE01AR02": "record_date",  # 记账年月
    # 欠税记录
    "PF01AQ01": "org_name",  # 主管税务机关
    "PF01AJ01": "amount",  # 欠税总额
    "PF01AR01": "stats_date",  # 欠税统计日期
    # 民事判决记录
    "PF02AQ01": "court_name",  # 立案法院
    "PF02AQ02": "cause",  # 案由
    "PF02AR01": "register_date",  # 立案日期
    "PF02AD01": "result_type",  # 结案方式
    "PF02AQ03": "result",  # 判决/调解结果
    "PF02AR02": "effective_date",  # 判决/调解生效日期
    "PF02AQ04": "litigious",  # 诉讼标的
    "PF02AJ01": "litigious_amt",  # 诉讼标的金额
    # 强制执行记录
    "PF03AQ01": "court_name",  # 执行法院
    "PF03AQ02": "cause",  # 执行案由
    "PF03AR01": "register_date",  # 立案日期
    "PF03AD01": "result_type",  # 结案方式
    "PF03AQ03": "case_status",  # 案件状态
    "PF03AR02": "case_end_date",  # 结案日期
    "PF03AQ04": "apply_execution_object",  # 申请执行标的
    "PF03AJ01": "apply_execution_object_amt",  # 申请执行标的金额
    "PF03AQ05": "executed_object",  # 已执行标的
    "PF03AJ02": "executed_object_amt",  # 已执行标的金额
    # 行政处罚记录
    "PF04AQ01": "org_name",  # 处罚机构
    "PF04AQ02": "content",  # 处罚内容
    "PF04AJ01": "amount",  # 处罚金额
    "PF04AR01": "effective_date",  # 处罚生效日期
    "PF04AR02": "end_date",  # 处罚截止日期
    "PF04AQ03": "reconsideration_result",  # 行政复议结果
    # 住房公积金参缴记录
    "PF05AQ01": "address",  # 参缴地
    "PF05AR01": "pay_date",  # 参缴日期
    "PF05AD01": "pay_status",  # 缴费状态
    "PF05AR02": "pay_month",  # 初缴月份
    "PF05AR03": "pay_duration_date",  # 缴至月份
    "PF05AQ02": "company_pay_rate",  # 单位缴存比例
    "PF05AQ03": "personal_pay_rate",  # 个人缴存比例
    "PF05AJ01": "month_fee_amt",  # 月缴存额
    "PF05AQ04": "pay_company_name",  # 缴费单位
    "PF05AR04": "info_update_date",  # 信息更新日期
    # 低保救助记录
    "PF06AD01": "personal_category",  # 人员类别
    "PF06AQ01": "address",  # 所在地
    "PF06AQ02": "work_place",  # 工作单位
    "PF06AQ03": "home_monthly_income",  # 家庭月收入
    "PF06AR01": "apply_date",  # 申请日期
    "PF06AR02": "approval_date",  # 批准日期
    "PF06AR03": "info_update_date",  # 信息更新日期
    # 执业资格记录
    "PF07AQ01": "qualification_name",  # 执业资格名称
    "PF07AQ02": "award_org",  # 颁发机构
    "PF07AD01": "grade",  # 等级
    "PF07AD02": "org_address",  # 机构所在地
    "PF07AR01": "award_date",  # 获得年月
    "PF07AR02": "expired_date",  # 到期年月
    "PF07AR03": "revoked_date",  # 吊销年月
    # 行政奖励记录
    "PF08AQ01": "reward_org",  # 奖励机构
    "PF08AQ02": "reward_content",  # 奖励内容
    "PF08AR01": "effective_date",  # 生效年月
    "PF08AR02": "expired_date",  # 截止年月
    # 查询记录
    "PH010R01": "jhi_time",  # 查询日期
    "PH010D01": "operator1",  # 查询机构类型
    "PH010Q02": "operator2",  # 查询机构
    "PH010Q03": "reason"  # 查询原因
}

# 一.表头及个人基本信息
# 身份证类型枚举值
cert_type_mapping = {
    '身份证': '10',
    '10': '10',
    '户口簿': '11',
    '1': '11',
    '临时身份证': '17',
    '军官证': '13',
    '士兵证': '14',
    '护照': '12',
    '2': '12',
    '港澳居民来往内地通行证': '15',
    '5': '15',
    '台湾同胞来往内地通行证': '16',
    '6': '16',
    '外国人居留证': '18',
    '8': '18',
    '警官证': '19',
    '9': '19',
    '其他证件': '23',
    'X': '23',
    '香港身份证': '24',
    'A': '24',
    '澳门身份证': '25',
    'B': '25',
    '台湾身份证': '26',
    'C': '26',
    '军人身份证件': '27',
    '20': '27'
}
# 性别枚举值
sex_mapping = {
    '男': '1',
    '1': '1',
    '女': '2',
    '2': '2',
    '未知': '0',
    '0': '0',
    '未说明': '9',
    '9': '9'
}
# 学历枚举值
education_mapping = {
    '研究生': '02',
    '10': '02',
    '本科': '03',
    '20': '03',
    '大专': '04',
    '30': '04',
    '中专': '05',
    '40': '05',
    '职高': '51',
    '技校': '06',
    '高中': '07',
    '60': '07',
    '初中': '08',
    '小学': '09',
    '其他': '90',
    '90': '90',
    '初中及以下': '91',
    '91': '91',
    '未知': '99',
    '99': '99'
}
# 学位枚举值
degree_mapping = {
    '博士': '01',
    '2': '01',
    '硕士': '02',
    '3': '02',
    '学士': '03',
    '4': '03',
    '名誉博士': '04',
    '1': '04',
    '未知': '98',
    '9': '98',
    '无': '05',
    '5': '05'
}
# 就业状况枚举值
employment_mapping = {
    '国家公务员': '11',
    '11': '11',
    '专业技术人员': '13',
    '13': '13',
    '职员': '17',
    '17': '17',
    '企业管理人员': '21',
    '21': '21',
    '工人': '24',
    '24': '24',
    '农民': '27',
    '27': '27',
    '学生': '31',
    '31': '31',
    '现役军人': '37',
    '37': '37',
    '自由职业者': '51',
    '51': '51',
    '个体经营者': '54',
    '54': '54',
    '无业人员': '70',
    '70': '70',
    '退（离）休人员': '80',
    '80': '80',
    '其他': '90',
    '90': '90',
    '在职': '91',
    '91': '91',
    '未知': '99',
    '99': '99'
}
# 婚姻状态枚举值
marriage_status_mapping = {
    '未婚': '1',
    '10': '1',
    '已婚': '2',
    '20': '2',
    '初婚': '21',
    '再婚': '22',
    '复婚': '23',
    '丧偶': '4',
    '30': '4',
    '离婚': '3',
    '40': '3',
    '未说明的婚姻状况': '90',
    '单身': '91',
    '91': '91',
    '未知': '99',
    '99': '99'
}
# 住宅类型枚举值
residence_status_mapping = {
    '自置': '01',
    '1': '01',
    '按揭': '02',
    '2': '02',
    '亲属楼宇': '03',
    '3': '03',
    '集体宿舍': '04',
    '4': '04',
    '租房': '05',
    '5': '05',
    '共有住宅': '06',
    '6': '06',
    '其他': '07',
    '7': '07',
    '未知': '08',
    '9': '08',
    '自有': '11',
    '11': '11',
    '借住': '12',
    '12': '12'
}
# 单位性质枚举值
company_type_mapping = {
    '机关、事业单位': '10',
    '10': '10',
    '国有企业': '20',
    '20': '20',
    '外资企业': '30',
    '30': '30',
    '个体、私营企业': '40',
    '40': '40',
    '其他': '50',
    '50': '50',
    '未知': '99',
    '99': '99'
}
# 职业枚举值
occupation_mapping = {
    '国家机关、党群组织、企业、事业单位负责人': '0',
    '0': '0',
    '专业技术人员': '1',
    '1': '1',
    '办事人员和有关人员': '3',
    '3': '3',
    '商业、服务业人员': '4',
    '4': '4',
    '农、林、牧、渔、水利业生产人员': '5',
    '5': '5',
    '生产、运输设备操作人员及有关人员': '6',
    '6': '6',
    '军人': 'X',
    'X': 'X',
    '不便分类的其他从业人员': 'Y',
    'Y': 'Y',
    '未知': 'Z',
    'Z': 'Z'
}
# 行业枚举值
industry_mapping = {
    '农、林、牧、渔业': 'A',
    '采矿业': 'B',
    '制造业': 'C',
    '电力、热力、燃气及水生产和供应业': 'D',
    '建筑业': 'E',
    '批发和零售业': 'F',
    '交通运输、仓储和邮储业': 'G',
    '住宿和餐饮业': 'H',
    '信息传输、软件和信息技术服务': 'I',
    '金融业': 'J',
    '房地产业': 'K',
    '租赁和商务服务业': 'L',
    '科学研究和技术服务业': 'M',
    '水利、环境和公共设施管理业': 'N',
    '居民服务、修理和其他服务业': 'O',
    '教育': 'P',
    '卫生和社会工作': 'Q',
    '文化、体育和娱乐业': 'R',
    '公共管理、社会保障和社会组织': 'S',
    '国际组织': 'T',
    '未知': '9'
}
# 职务枚举值
position_mapping = {
    '高级领导': '1',
    '中级领导': '2',
    '一般员工': '3',
    '其他': '4',
    '未知': '9'
}
# 职称枚举值
post_title_mapping = {
    '高级': '1',
    '中级': '2',
    '初级': '3',
    '无': '0',
    '未知': '9'
}

# 二.信息概要
# 信贷交易信息业务类型枚举值
business_type_mapping = {
    '贷款': '01',
    '1': '01',
    '信用卡': '02',
    '2': '02',
    '其他': '03',
    '9': '03',
    '合计': '04'
}
# 业务子类型枚举值
business_subtype_mapping = {
    '个人住房贷款': '0101',
    '11': '0101',
    '个人商用房贷款（包括商住两用房）': '0102',
    '12': '0102',
    '其他类贷款': '0103',
    '19': '0103',
    '贷记卡': '0201',
    '21': '0201',
    '准贷记卡': '0202',
    '22': '0202',
}
# 交易违约信息交易类型枚举值
default_type_mapping = {
    '被追偿信息汇总': '01',
    '呆账信息汇总': '02',
    '逾期（透支）信息汇总': '03',
    '其他': '09'
}
# 违约信息子类型枚举值
default_subtype_mapping = {
    '资产处置业务': '0101',
    '1': '0101',
    '垫款业务': '0102',
    '2': '0102',
    '合计': '0103',
    '非循环贷账户': '0301',
    '循环额度下分账户': '0302',
    '循环贷账户': '0303',
    '贷记卡账户': '0304',
    '准贷记卡账户': '0305',
    '其他': '9999'
}
# 非信贷交易业务类型
noncredit_business_type_mapping = {
    '电信业务': '01',
    '1': '01',
    '自来水业务': '02',
    '2': '02',
    '其他': '09'
}
# 公共信息业务类型
public_type_mapping = {
    '欠税信息': '01',
    '1': '01',
    '民事判决信息': '02',
    '2': '02',
    '强制执行信息': '03',
    '3': '03',
    '行政处罚信息': '04',
    '4': '04',
    '住房公积金参缴信息': '05',
    '低保救助信息': '06',
    '执业资格信息': '07',
    '行政奖励信息': '08'
}
# 查询记录查询类型枚举值
query_type_mapping = {
    '贷款审批': '01',
    '02': '01',
    '信用卡审批': '02',
    '03': '02',
    '担保资格审查': '03',
    '08': '03',
    '贷后管理': '04',
    '异议核查': '05',
    '特约商户实名审查': '06',
    '公积金提取复核': '07',
    '保前审查': '08',
    '融资审批': '09',
    '24': '09'
}
# 三 信贷交易信息明细
# 特殊交易类型枚举值
special_type_mapping = {
    '展期': '1',
    '担保人（第三方）代偿': '2',
    '以资抵债': '3',
    '提前还款': '4',
    '提前还款（包括提前归还部分本金、还款期限不变，以及缩短还款期限两种情况）': '4',
    '提前结清': '5',
    '强制平仓，未结清': '6',
    '强制平仓，已结清': '7',
    '司法追偿': '8',
    '债务减免': '11',
    '资产剥离': '12',
    '资产转让': '13',
    '信用卡个性化分期': '14',
    '核销': '15',
    '银行主动延期': '16',
    '强制平仓': '17',
    '其他': '99'
}
# 账户类型枚举值
account_type_mapping = {
    '非循环贷账户': '01',
    'D1': '01',
    '循环额度下分账户': '02',
    'R4': '02',
    '循环贷账户': '03',
    'R1': '03',
    '贷记卡账户': '04',
    'R2': '04',
    '准贷记卡账户': '05',
    'R3': '05',
    '相关还款责任': '06',
    '授信协议': '07'
}
# 授信额度用途枚举值
credit_purpose_mapping = {
    '非循环贷款额度': '01',
    '20': '01',
    '循环贷款额度': '02',
    '10': '02',
    '信用卡共享额度': '03',
    '30': '03',
    '信用卡独立额度': '04',
    '31': '04'
}
# 还款责任对象枚举值
response_object_mapping = {
    '有相关还款责任的个人借款': '01',
    '有相关还款责任的企业借款': '02'
}
# 相关还款责任身份类别
response_id_type_mapping = {
    '自然人': '1',
    '组织机构': '2',
    '为个人': '1',
    '为企业': '2'
}
# 相关还款责任类型
response_subtype_mapping = {
    '担保责任': '1',
    '其他相关还款责任': '9'
}
# 还款责任人类型枚举值
response_type_mapping = {
    '共同借款人': '1',
    '保证人': '2',
    '票据承兑人': '3',
    '应收账款债务人': '4',
    '供应链中核心企业': '5',
    '其他': '9'
}
# 还款频率枚举值
repay_frequency_mapping = {
    '日': '01',
    '周': '02',
    '月': '03',
    '季': '04',
    '半年': '05',
    '年': '06',
    '一次性': '07',
    '不定期': '08',
    '旬': '12',
    '双周': '13',
    '双月': '14',
    '其他': '99'
}
# 五级分类枚举值
category_mapping = {
    '正常': '1',
    '关注': '2',
    '次级': '3',
    '可疑': '4',
    '损失': '5',
    '未分类': '9'
}
# 个人贷款类型枚举值
indiv_loan_type_mapping = {
    '个人经营性贷款': '01',
    '41': '01',
    '个人汽车贷款': '02',
    '个人汽车消费贷款': '02',
    '21': '02',
    '个人汽车贷款, 个人汽车消费贷款': '02',
    '个人商用房（包括商住两用）贷款': '03',
    '个人商用房（含商住两用）贷款': '03',
    '12': '03',
    '个人商用房（包括商住两用）贷款, 个人商用房（含商住两用）贷款': '03',
    '个人消费贷款': '04',
    '其他个人消费贷款': '04',
    '91': '04',
    '个人消费贷款, 其他个人消费贷款': '04',
    '个人住房贷款': '05',
    '个人住房商业贷款': '05',
    '11': '05',
    '个人住房贷款, 个人住房商业贷款': '05',
    '个人住房公积金贷款': '06',
    '13': '06',
    '农户贷款': '07',
    '51': '07',
    '个人助学贷款': '08',
    '31': '08',
    '贷记卡': '11',
    '81': '11',
    '准贷记卡': '12',
    '71': '12',
    '国家助学贷款': '13',
    '32': '13',
    '商业助学贷款': '14',
    '33': '14',
    '经营性农户贷款': '15',
    '52': '15',
    '消费性农户贷款': '16',
    '53': '16',
    '大额专项分期卡': '17',
    '82': '17',
    '约定购回式证券交易': '18',
    '61': '18',
    '股票质押式回购交易': '19',
    '62': '19',
    '融资融券业务': '20',
    '63': '20',
    '其他证券类融资': '21',
    '64': '21',
    '融资租赁业务': '22',
    '92': '22',
    # '资产处置': '23',
    'A1': '23',
    '代偿债务': '24',
    'B1': '24',
    '流动资金贷款': '25',
    '固定资产贷款': '26',
    '境外筹资转贷款': '27',
    '国内买方信贷': '28',
    '出口卖方信贷': '29',
    '项目融资': '30',
    '并购贷款': '31',
    '企业债': '企业债',
    '贷款': '贷款',
    '贸易融资': '贸易融资',
    '保理融资': '保理融资',
    '融资租赁': '融资租赁',
    '证券类融资': '证券类融资',
    '透支': '透支',
    '票据贴现': '票据贴现',
    '黄金借款': '黄金借款',
    '垫款': '垫款',
    '资产处置': '资产处置',
    '其他': '99'
}
# 相关还款责任业务种类枚举值
resp_loan_type_mapping = {
    '10': '企业债',
    '11': '贷款',
    '12': '贸易融资',
    '13': '保理融资',
    '14': '融资租赁',
    '15': '证券类融资',
    '16': '透支',
    '21': '票据贴现',
    '31': '黄金借款',
    '41': '垫款',
    '51': '资产处置',
    '99': '其他'
}
# 企业贷款类型枚举值
ent_loan_type_mapping = {
    '流动资金贷款': '21',
    '固定资产贷款': '22',
    '境外筹资转贷款': '23',
    '国内买方信贷': '24',
    '出口卖方信贷': '25',
    '项目融资': '26',
    '并购贷款': '27',
    '其他贷款': '90'
}
# 贷款发放形式枚举值
loan_form_mapping = {
    '新增': '1',
    '其他机构转入': '5'
}
# 担保类型枚举值
guar_type_mapping = {
    '保证': '3',
    '3': '3',
    '抵押': '2',
    '2': '2',
    '农户联保': '7',
    '7': '7',
    '信用/免担保': '4',
    '4': '4',
    '质押': '1',
    '组合（不含保证）': '6',
    '6': '6',
    '组合（含保证）': '5',
    '5': '5',
    '其他': '99',
    '9': '99'
}
# 还款方式枚举值
repay_type_mapping = {
    '分期等额本息': '11',
    '分期等额本金': '12',
    '到期还本分期结息': '13',
    '等比累进分期还款': '14',
    '等额累进分期还款': '15',
    '其他类型分期还款': '19',
    '到期一次还本付息': '21',
    '预先付息到期还本': '22',
    '随时还': '23',
    '按期结息，到期还本': '31',
    '按期结息，自由还本': '32',
    '按期计算还本付息': '33',
    '循环贷款下其他还款方式': '39',
    '不区分还款方式': '90'
}
# 账户状态枚举值
# D1、R1、R4
loan_status_mapping_1 = {
    '正常': '01',
    '1': '01',
    '逾期': '02',
    '2': '02',
    '呆账': '03',
    '4': '03',
    '结清': '04',
    '3': '04',
    '止付': '06',
    '销户': '07',
    '未激活': '08',
    '银行止付': '09',
    '5': '09',
    '司法追偿': '10',
    '8': '10',
    '转出': '99',
    '其他': '99'
}
# R2、R3
loan_status_mapping_2 = {
    '正常': '01',
    '1': '01',
    '逾期': '02',
    '呆账': '03',
    '5': '03',
    '结清': '04',
    '冻结': '05',
    '2': '05',
    '止付': '06',
    '3':'06',
    '销户': '07',
    '4': '07',
    '未激活': '08',
    '6': '08',
    '银行止付': '09',
    '31': '09',
    '司法追偿': '10',
    '8': '10',
    '转出': '99',
    '其他': '99'
}
# 机构类型代码表
account_org_type_mapping = {
    '11': '商业银行',
    '12': '村镇银行',
    '14': '住房储蓄银行',
    '15': '外资银行',
    '16': '财务公司',
    '21': '信托公司',
    '22': '融资租赁公司',
    '23': '汽车金融公司',
    '24': '消费金融公司',
    '25': '贷款公司',
    '26': '金融资产管理公司',
    '31': '证券公司',
    '41': '保险公司',
    '51': '小额贷款公司',
    '52': '公积金管理中心',
    '53': '融资担保公司',
    '54': '保理公司',
    '99': '其他机构'
}

# 四.非信贷交易信息明细
# 业务类型枚举值
biz_type_mapping = {
    '固定电话': '1',
    '移动电话': '2',
    '自来水费': '02',
    '互联网接入': '3',
    '数据专线及集群业务': '4',
    '卫星业务': '5',
    '组合业务': '6',
    '其他业务': '0'
}
# 缴费状态枚举值
biz_status_mapping = {
    '正常': '01',
    '0': '01',
    '欠费': '02',
    '1': '02',
    '其他': '09'
}
# 八.查询记录
# 查询原因枚举值
query_reason_mapping = {
    '贷款审批': '01',
    '02': '01',
    '信用卡审批': '02',
    '03': '02',
    '担保资格审查': '03',
    '08': '03',
    '贷后管理': '04',
    '01': '04',
    '异议核查': '05',
    '特约商户实名审查': '06',
    '19': '06',
    '公积金提取审查': '07',
    '保前审查': '08',
    '20': '08',
    '融资审查': '09',
    '客户准入资格审查': '10',
    '23': '10',
    '额度审批': '11',
    '26': '11',
    '法人代表、负责人、高管等资信审查': '12',
    '22': '12',
    '资信审查': '13',
    '25': '13',
    '公积金提取复核查询': '14',
    '16': '14',
    '股指期货开户': '15',
    '18': '15',
    '司法调查': '16',
    '09': '16',
    '保后管理': '17',
    '21': '17',
    '本人查询': '18',
    '融资审批': '20',
    '24': '20',
    '其他': '99'
}
