# 一、多头交易类型关键字
# 消费金融
CONSUME_FINANCE = "消费金融|消费银企|陆金所|微粒贷|微众银行|微业贷|花呗|借呗|360还款|消费贷款|" \
                  "消金|京东金融|还呗|分期乐|平安普惠|美团放款"
# 消费金融剔除关键字
CONSUME_FINANCE_EXCEPT = "退还|退回|基金申购|担保"

# 微信支付宝消费金融
WXZFB_CONSUME_FINANCE = "消费金融还款"

# 融资租赁
FINANCE_LEASE = "融资租赁|国际租赁|金融租赁|仲利国际租赁|诚泰融资租赁|广汽租赁|租赁融资"

# 担保关键字
GUARANTEE = "担保"
# 担保剔除关键字
GUARANTEE_EXCEPT = "法院"

# 保理关键字
FACTORING = "保理"

# 小贷关键字
SMALL_LOAN = "小额贷|小贷|互联网信息咨询|360借条|中安信业|360网络贷款|美团借钱|陕银消费|瀚华|富登|人人贷"
# 小贷剔除关键字
SMALL_LOAN_EXCEPT = "小额贷记来账|信用卡|服务费"

# 微信支付宝小贷关键字
WXZFB_SMALL_LOAN = "贷款|借呗"

# 银行放款交易对手关键字
BANK_LOAN_OPPONENT_NAME = "银行|个贷|贷款|放款过渡户|信贷|海信集团财务有限公司|海尔集团财务有限责任公司"
# 银行放款交易对手剔除关键字
BANK_LOAN_OPPONENT_NAME_EXCEPT = r"0|1|2|3|4|5|6|7|8|9|网上商城|/|:|：|\\"
# 银行放款备注关键字
BANK_LOAN_REMARK = "放款|贷款|信贷|放贷"
# 银行放款剔除关键字
BANK_LOAN_CONCAT_STR_EXCEPT = "贴现放款|消费|转存|POS|pos|转支|电子商务|工程|工资|验证|转账"
# 银行放款兼容关键字
BANK_LOAN_CONCAT_STR_COMPATIBLE = "消费贷"

# 微信支付宝银行放款关键字
WXZFB_BANK_LOAN = "网商银行"
# 微信支付宝银行放款备注剔除关键字
WXZFB_BANK_LOAN_REMARK_EXCEPT = "余利宝"

# 银行还款交易对手关键字
BANK_REPAY_OPPONENT_NAME = "银行|个贷"
# 银行还款交易对手剔除关键字
BANK_REPAY_OPPONENT_NAME_EXCEPT = r"0|1|2|3|4|5|6|7|8|9|网上商城|/|:|：|\\"
# 银行还款备注关键字
BANK_REPAY_REMARK = "放款|贷款|信贷|放贷"
# 银行还款剔除关键字
BANK_REPAY_CONCAT_STR_EXCEPT = "收单|短信服务|工资|电费|缴税|手续费|回单服务|人寿保险|管理费|服务费|信使费|ETC|POS|消费|" \
                               "转存|etc|pos|转支|代收"
# 银行还款兼容关键字
BANK_REPAY_CONCAT_STR_COMPATIBLE = "消费贷"
# 银行还款关键字
BANK_REPAY_CONCAT_STR = "还贷|自动还款|贷款利息|约定还款|贷款回收|批量代扣|约定还款|收回利息|贷款业务|批量扣款|还本金"

# 受托支付关键字
ENTRUSTED_PAY = "受托支付"

# 第三方支付关键字
THIRD_REPAY_1 = "支付宝|特约|聚合支付|平安付|网银在线|抖音月付|抖音支付"
THIRD_REPAY_2 = "借|还"
# 第三方支付剔除关键字
THIRD_REPAY_EXCEPT = "信用卡|银行"

# 其他金融关键字
OTHER_FINANCE = "信托|贷.*过渡户|过渡户.*贷|财务.*公司|资金互助社|金融.*公司|供应链融资|车贷放款|融资作业" \
                "|租赁.*还|其他外围|陆家嘴国际金融资产交易市场|保险.*贷款"
# 其他金融剔除关键字
OTHER_FINANCE_EXCEPT = "综合金融服务平台|财务咨询|小微商户|中移动金融科技|金融[城街]|工程款|服务费|" \
                       "材料款|预付款|保证金|项目款|代理费|竞价|报价|运输款|运输费|信用卡"
# 其他金融交易对手为个人关键字
OTHER_FINANCE_PER = "车贷|还车款|汽车金融"
# 其他金融关联关系关键字
OTHER_FINANCE_RELATION = "车辆按揭"
# 其他金融交易渠道剔除关键字
OTHER_FINANCE_CHANNEL_EXCEPT = "清算中心"
# 其他金融剔除企业
OTHER_FINANCE_ENT_EXCEPT = "浙江即富金融数据处理|现代金融控股|宝付网络科技"

# 民间借贷关键字
PRIVATE_LENDING = "信贷|融资|垫款|个人.*贷|现金分期|借|还|本金|房贷|转贷|过桥|民间融资服务中心"
# 民间借贷兼容关键字
PRIVATE_LENDING_COMPATIBLE = "抵押"
# 民间借贷剔除关键字
PRIVATE_LENDING_EXCEPT_1 = \
    "贷款转存|贷记|ETC|无折借|借支|退还|返还|借记|信用卡|贴现|货款|床垫|消费|POS|钱生钱|特约|招标|退耕还林|还地桥|物流|" \
    "退本金|股本金|理财|钱生钱|余额宝|零钱通|招财盈|宜人财富|投资本金|租|工资|税|水电"
PRIVATE_LENDING_EXCEPT_2 = \
    "工资|奖金|年终奖|差旅费|报销|福利费|慰问|公共缴费|租|保险|支付宝|信用卡|消费|特约|服务费|停车费|理财|钱生钱|余额宝|" \
    "零钱通|招财盈|宜人财富|投资本金|租|工资|税|水电"
# 民间借贷付息关键字
PRIVATE_LENDING_INTEREST = "利息|结息"
# 民间借贷付息剔除关键字
PRIVATE_LENDING_INTEREST_EXCEPT = "计提"
# 民间借贷交易对手剔除关键字
PRIVATE_LENDING_OPPONENT_NAME = "银行"


# 二、异常交易类型关键字
# 博彩关键字
GAMBLE = r"(彩票|博彩)"
# 博彩进账关键字
GAMBLE_INCOME = r"(返奖|退款)"

# 娱乐不良关键字
AMUSEMENT = r"(夜总会|ktv|娱乐|洗浴|会所)"
# 娱乐不良剔除关键字
AMUSEMENT_EXCEPT = r"(采购|投标保证金|货款|工程|加工|材料费|材料款|机械费|运费|装修|空调)"

# 案件纠纷关键字
CASE_DISPUTES = r"(人民法院)"

# 治安罚款出账关键字
SECURITY_EXPENSE_FINES = r"(公安)"
# 治安罚款关键字
SECURITY_FINES = r"(保释)"
# 治安罚款剔除关键字
SECURITY_FINES_EXCEPT = r"(交通|公安县)"

# 保险理赔关键字
INSURANCE_CLAIMS = r"(理赔|赔款)"

# 股票期货交易对手关键字
STOCK_OPPONENT_NAME = r"(证券|期货)"
# 股票期货备注关键字
STOCK_REMARK = r"(银证|证券|银转证|证转银|期货|银期转账|银转期|期转银)"
# 股票期货剔除关键字
WXZFB_STOCK_OPPONENT_NAME_EXCEPT = r"(网商银行|救助基金会)"

# 医院关键字
HOSPITAL = r"(医院|药房|门诊|急诊|住院)"
# 医院剔除关键字
HOSPITAL_EXCEPT = r"(宠物医院|美容医院|退款|店|整形|采购|投标保证金|货款|工程|工资|加工|材料款|材料费|停车|" \
                  r"机械费|运费|装修|空调|净化|系统|划款|耗材)"

# 贷款异常担保关键字
LOAN_GUAR_ABNORMAL = r"(还本|还款|还贷|本金)"
# 贷款异常关键字
LOAN_ABNORMAL = r"(逾期|罚息)"

# 对外担保异常关键字
GUAR_ABNORMAL = r"(替.+还款|代偿)"

# 典当关键字
NORITOMO = r"(典当)"


# 三、成本支出关键字
# 工资
SALARY = r"(工资|奖金|年终奖|差旅费|报销|福利费|慰问|公共缴费)"
# 水电
UTILITIES = r"(电费|水费|水电费|煤气|燃气)"
# 税费
TAX = r"(税)"
# 房租
RENT = r"(房租|租金)"
# 保险
INSURANCE = r"(保险|保费|维修费)"
# 可变成本
VARIABLE_COST = r"(购原材料|购买材料|材料款)"


# 四、其他画像
# 整进整出剔除关键字
BIG_IN_OUT_EXCEPT = "冲正|抹账"

# 快进快出交易对手剔除关键字
FAST_IN_OUT_OPPONENT_NAME_EXCEPT = "转账|转存|转支"
# 快进快出剔除关键字
FAST_IN_OUT_EXCEPT = "冲正|抹账"

# 家庭不稳定交易金额
FAMILY_RISK_AMT = [5.20, 5.21, 13.14, 14.13, 20.20, 20.13, 20.14, 131.4, 201.3, 201.4, 520,
                   520.20, 521, 1314, 1314.2, 1413, 1413.2, 2013.14, 2014.13, 201314, 2020.2,
                   202020.2, 13145.2, 1314520, 52013.14, 5201314]

# 理财行为进账关键字
FINANCING_INCOME = "到期|赎回|理财收益"
# 理财行为出账关键字
FINANCING_EXPENSE = "认购|买入|理财本金|理财购买"

# 房产买卖关键字
HOUSE_TRADE = "买房|卖房|首付|售房|房地产|置业|购房|认筹|房产评估费|房屋评估费|房款|房产"
HOUSE_OPPO = "有限公司"
# 房产买卖剔除关键字
HOUSE_TRADE_EXCEPT_1 = "装修|工程|施工|外墙保温|货款|消费|报销|客户转账|餐费|物业费|水费|酒店|项目|零售|顾问|销售|清偿" \
                       "|派单|营销|报广|服务费|安装|门窗|租|电费|福利|电缆|包装|制作|插座|监理|建设|超能玩宝" \
                       "|车位|宣传|广告|住宿|借款|金属|维修|质保|供货|设计|采购|供应|面积差|检测|消防|咨询|买卖"


# 五、交易对手类型关键字
# 企业
ENT_TYPE = r"(厂|店|公司|经营部)$"
# 开头关键字
TYPE_START_1 = r"(支付宝|消费支付宝|淘宝)"
TYPE_START_2 = r"(转账|跨行转出|对私提)"
# 剔除关键字
TYPE_EXCEPT_1 = r"[^\u4e00-\u9fa5 *]|支付宝转账|支付宝代发"
TYPE_EXCEPT_2 = r"(支付宝外部商户|支付宝划账|支付宝| |消费支付宝|淘宝)"
TYPE_EXCEPT_3 = r"(转|贷|消费|自取|资金|自定义|友宝|分期|肯德基|代付|麦当劳|携程|红包|活期|房租" \
                r"|过渡|必胜客|理财|缴费|工资|特约|还款|充值|京东|星巴克|银联|拼多多|爱奇艺|采购" \
                r"|天猫|租金|提现|淘宝|\*\*|备用|撤销|花呗|借呗|余额宝|全家)|[费款税账]$"
TYPE_EXCEPT_4 = r"[财存天停大柜订百本宝网保北电放还好汇结借跨理利内其上深浙税现中微短发卡随有月油退收快取]"
